Tekla Open API Reference for Tekla Structures 2025
CategoryName Methods
The ObjectTypesFilterExpressions.CategoryName type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ObjectTypesFilterExpressions.CategoryName Class
Tekla.Structures.Filtering.Categories Namespace